In [3]:
import numpy as np
import pandas as pd

In [4]:
dict1 = {"name":['Harry', 'Rohan', 'Gomati', 'Shubh'],
         "marks":[12, 34, 24, 67],
         "city":['Rampur', 'Kolkata', 'Bareilly', 'Chetanpur']
         }

In [5]:
df = pd.DataFrame(dict1) #it will show data in tabular form

In [6]:
df

     name  marks       city
0   Harry     12     Rampur
1   Rohan     34    Kolkata
2  Gomati     24   Bareilly
3   Shubh     67  Chetanpur

In [7]:
df.to_csv('colleague.csv',index=False) #excel sheet is created

In [8]:
colleague = pd.read_csv('colleague.csv') #excel sheet read in python

In [9]:
colleague

     name  marks       city
0   Harry     12     Rampur
1   Rohan     34    Kolkata
2  Gomati     24   Bareilly
3   Shubh     67  Chetanpur

In [10]:
colleague['marks'] #only column marks

0    12
1    34
2    24
3    67
Name: marks, dtype: int64

In [11]:
colleague['marks'][0] #particular index value

12

In [12]:
colleague['marks'][0] = 60 #it will give a warning but the value is changed

C:\Users\shahd\AppData\Local\Temp\ipykernel_17660\1557041505.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  colleague['marks'][0] = 60 #it will give a warning but the value is changed

In [13]:
colleague #u can observe that the value is changed of the harry marks which is index = 0

     name  marks       city
0   Harry     60     Rampur
1   Rohan     34    Kolkata
2  Gomati     24   Bareilly
3   Shubh     67  Chetanpur

In [14]:
colleague.index = ['first', 'second', 'third', 'fourth']

In [15]:
colleague

          name  marks       city
first    Harry     60     Rampur
second   Rohan     34    Kolkata
third   Gomati     24   Bareilly
fourth   Shubh     67  Chetanpur

In [16]:
colleague.head(2) #it will show the first 2 rows

         name  marks     city
first   Harry     60   Rampur
second  Rohan     34  Kolkata

In [17]:
colleague.tail(2) #it will show the last 2 rows

          name  marks       city
third   Gomati     24   Bareilly
fourth   Shubh     67  Chetanpur

In [18]:
colleague.describe()

           marks
count   4.000000
mean   46.250000
std    20.532495
min    24.000000
25%    31.500000
50%    47.000000
75%    61.750000
max    67.000000

# Now trying a random dataframe

In [19]:
newdf = pd.DataFrame(np.random.rand(300,5), index=np.arange(300))

In [20]:
newdf.head()

          0         1         2         3         4
0  0.104160  0.334419  0.176838  0.920175  0.975713
1  0.977143  0.598838  0.910580  0.915306  0.316264
2  0.639937  0.355943  0.705022  0.354279  0.364612
3  0.952874  0.019843  0.241881  0.177285  0.585335
4  0.131972  0.039154  0.233552  0.082778  0.805883

In [21]:
type(newdf)

pandas.core.frame.DataFrame

In [22]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [23]:
newdf.T # transpose

,0,1,2,3,4,5,6,7,8,9,...,290,291,292,293,294,295,296,297,298,299
0,0.104160,0.977143,0.639937,0.952874,0.131972,0.252610,0.933193,0.553876,0.975363,0.758323,...,0.381151,0.745532,0.939399,0.524602,0.233668,0.069848,0.714818,0.501893,0.917042,0.031007
1,0.334419,0.598838,0.355943,0.019843,0.039154,0.193658,0.667971,0.744134,0.480706,0.367681,...,0.609194,0.295310,0.241628,0.136657,0.597849,0.251050,0.909606,0.220964,0.363436,0.503091
2,0.176838,0.910580,0.705022,0.241881,0.233552,0.310924,0.147230,0.067221,0.128569,0.926447,...,0.032940,0.482064,0.021441,0.516460,0.464256,0.067662,0.627688,0.872021,0.338108,0.906392
3,0.920175,0.915306,0.354279,0.177285,0.082778,0.561058,0.174684,0.666780,0.922885,0.503555,...,0.375667,0.979632,0.795655,0.143898,0.786243,0.868546,0.007377,0.010190,0.422926,0.911371
4,0.975713,0.316264,0.364612,0.585335,0.805883,0.887949,0.783220,0.442002,0.976093,0.051538,...,0.949844,0.539091,0.670096,0.472747,0.196971,0.225196,0.372911,0.823035,0.311787,0.507661

In [24]:
newdf.loc[0,0]='harry'

In [25]:
newdf

            0         1         2         3         4
0       harry  0.334419  0.176838  0.920175  0.975713
1    0.977143  0.598838  0.910580  0.915306  0.316264
2    0.639937  0.355943  0.705022  0.354279  0.364612
3    0.952874  0.019843  0.241881  0.177285  0.585335
4    0.131972  0.039154  0.233552  0.082778  0.805883
..        ...       ...       ...       ...       ...
295  0.069848  0.251050  0.067662  0.868546  0.225196
296  0.714818  0.909606  0.627688  0.007377  0.372911
297  0.501893  0.220964  0.872021  0.010190  0.823035
298  0.917042  0.363436  0.338108  0.422926  0.311787
299  0.031007  0.503091  0.906392  0.911371  0.507661

[300 rows x 5 columns]

In [26]:
newdf.columns = list("ABCDE")
newdf

            A         B         C         D         E
0       harry  0.334419  0.176838  0.920175  0.975713
1    0.977143  0.598838  0.910580  0.915306  0.316264
2    0.639937  0.355943  0.705022  0.354279  0.364612
3    0.952874  0.019843  0.241881  0.177285  0.585335
4    0.131972  0.039154  0.233552  0.082778  0.805883
..        ...       ...       ...       ...       ...
295  0.069848  0.251050  0.067662  0.868546  0.225196
296  0.714818  0.909606  0.627688  0.007377  0.372911
297  0.501893  0.220964  0.872021  0.010190  0.823035
298  0.917042  0.363436  0.338108  0.422926  0.311787
299  0.031007  0.503091  0.906392  0.911371  0.507661

[300 rows x 5 columns]

In [27]:
newdf.iloc[0,4]

0.9757132920084675

In [28]:
newdf.iloc[[0,4],[1,2]]

          B         C
0  0.334419  0.176838
4  0.039154  0.233552

# Third dataframe

In [41]:
dataf = pd.DataFrame({"name": ['Alfred','Batman','Catwoman','Catwoman'],
                   "toy": [np.nan, "Batmobile", "Bullwhip","Gujju"],
                   "born": [pd.NaT,pd.Timestamp("1940-04-25"),pd.NaT,pd.NaT]})

In [42]:
dataf

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3  Catwoman      Gujju        NaT

In [43]:
dataf.dropna(how='all',axis=1)

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
2  Catwoman   Bullwhip        NaT
3  Catwoman      Gujju        NaT

In [47]:
dataf.drop_duplicates(subset=['name'],keep='last')

       name        toy       born
0    Alfred        NaN        NaT
1    Batman  Batmobile 1940-04-25
3  Catwoman      Gujju        NaT

In [48]:
dataf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    4 non-null      object
 1   toy     3 non-null      object
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), object(2)
memory usage: 224.0+ bytes

In [50]:
dataf.shape

(4, 3)

In [52]:
dataf['toy'].value_counts(dropna=False)

NaN          1
Batmobile    1
Bullwhip     1
Gujju        1
Name: toy, dtype: int64

In [53]:
dataf.isnull()

    name    toy   born
0  False   True   True
1  False  False  False
2  False  False   True
3  False  False   True

In [ ]:
dataf.describe()
dataf.mean()
dataf.corr()
dataf.count ()
dataf.max()
dataf.min()
dataf.median()
dataf.std()